garyPenhook/PIC-Assembler/edc/PIC18F06Q40.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="U2RXPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="U2RXPPS" edc:nzwidth="8" edc:por="--010001" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q41_14pin_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3a" edc:_addr="0x274">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U2RXPPS" edc:mask="0x3f" edc:name="U2RXPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="U2RXPPS0" edc:mask="0x1" edc:name="U2RXPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2RXPPS1" edc:mask="0x1" edc:name="U2RXPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2RXPPS2" edc:mask="0x1" edc:name="U2RXPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2RXPPS3" edc:mask="0x1" edc:name="U2RXPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2RXPPS4" edc:mask="0x1" edc:name="U2RXPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2RXPPS5" edc:mask="0x1" edc:name="U2RXPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="U2CTSPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="U2CTSPPS" edc:nzwidth="8" edc:por="--010010" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q41_14pin_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3a" edc:_addr="0x275">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U2CTSPPS" edc:mask="0x3f" edc:name="U2CTSPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="U2CTSPPS0" edc:mask="0x1" edc:name="U2CTSPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2CTSPPS1" edc:mask="0x1" edc:name="U2CTSPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2CTSPPS2" edc:mask="0x1" edc:name="U2CTSPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2CTSPPS3" edc:mask="0x1" edc:name="U2CTSPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2CTSPPS4" edc:mask="0x1" edc:name="U2CTSPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2CTSPPS5" edc:mask="0x1" edc:name="U2CTSPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="U3RXPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="U3RXPPS" edc:nzwidth="8" edc:por="--000100" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q41_14pin_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3a" edc:_addr="0x276">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U3RXPPS" edc:mask="0x3f" edc:name="U3RXPPS" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="U3RXPPS0" edc:mask="0x1" edc:name="U3RXPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U3RXPPS1" edc:mask="0x1" edc:name="U3RXPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U3RXPPS2" edc:mask="0x1" edc:name="U3RXPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U3RXPPS3" edc:mask="0x1" edc:name="U3RXPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U3RXPPS4" edc:mask="0x1" edc:name="U3RXPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U3RXPPS5" edc:mask="0x1" edc:name="U3RXPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="U3CTSPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="U3CTSPPS" edc:nzwidth="8" edc:por="--000101" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q41_14pin_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3a" edc:_addr="0x277">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U3CTSPPS" edc:mask="0x3f" edc:name="U3CTSPPS" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="U3CTSPPS0" edc:mask="0x1" edc:name="U3CTSPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U3CTSPPS1" edc:mask="0x1" edc:name="U3CTSPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U3CTSPPS2" edc:mask="0x1" edc:name="U3CTSPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U3CTSPPS3" edc:mask="0x1" edc:name="U3CTSPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U3CTSPPS4" edc:mask="0x1" edc:name="U3CTSPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U3CTSPPS5" edc:mask="0x1" edc:name="U3CTSPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x10" edc:_addr="0x278"/>
        <edc:SFRDef edc:access="nnnn--nn" edc:cname="RC1I2C" edc:desc="" edc:impl="0xf3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000--00" edc:name="RC1I2C" edc:nzwidth="8" edc:por="0000--00" edc:_modsrc="DOS-03989_pad_8bit_i2c_v2_8-20pin.Module" edc:_refcount="1" edc:_begin="0x2" edc:_end="0x4" edc:_addr="0x288">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TH" edc:mask="0x3" edc:name="TH" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="PU" edc:mask="0x3" edc:name="PU" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="SLEW" edc:mask="0x3" edc:name="SLEW" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TH0" edc:mask="0x1" edc:name="TH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TH1" edc:mask="0x1" edc:name="TH1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="PU0" edc:mask="0x1" edc:name="PU0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PU1" edc:mask="0x1" edc:name="PU1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLEW0" edc:mask="0x1" edc:name="SLEW0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLEW1" edc:mask="0x1" edc:name="SLEW1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="I2CTH" edc:mask="0x3" edc:name="I2CTH" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="I2CPU" edc:mask="0x3" edc:name="I2CPU" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW" edc:mask="0x3" edc:name="I2CSLEW" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="I2CTH0" edc:mask="0x1" edc:name="I2CTH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CTH1" edc:mask="0x1" edc:name="I2CTH1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="I2CPU0" edc:mask="0x1" edc:name="I2CPU0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CPU1" edc:mask="0x1" edc:name="I2CPU1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW0" edc:mask="0x1" edc:name="I2CSLEW0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW1" edc:mask="0x1" edc:name="I2CSLEW1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn--nn" edc:cname="RC0I2C" edc:desc="" edc:impl="0xf3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000--00" edc:name="RC0I2C" edc:nzwidth="8" edc:por="0000--00" edc:_modsrc="DOS-03989_pad_8bit_i2c_v2_8-20pin.Module" edc:_refcount="1" edc:_begin="0x2" edc:_end="0x4" edc:_addr="0x289">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TH" edc:mask="0x3" edc:name="TH" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="PU" edc:mask="0x3" edc:name="PU" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="SLEW" edc:mask="0x3" edc:name="SLEW" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TH0" edc:mask="0x1" edc:name="TH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TH1" edc:mask="0x1" edc:name="TH1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="PU0" edc:mask="0x1" edc:name="PU0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PU1" edc:mask="0x1" edc:name="PU1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLEW0" edc:mask="0x1" edc:name="SLEW0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLEW1" edc:mask="0x1" edc:name="SLEW1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="I2CTH" edc:mask="0x3" edc:name="I2CTH" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="I2CPU" edc:mask="0x3" edc:name="I2CPU" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW" edc:mask="0x3" edc:name="I2CSLEW" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="I2CTH0" edc:mask="0x1" edc:name="I2CTH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CTH1" edc:mask="0x1" edc:name="I2CTH1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="I2CPU0" edc:mask="0x1" edc:name="I2CPU0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CPU1" edc:mask="0x1" edc:name="I2CPU1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW0" edc:mask="0x1" edc:name="I2CSLEW0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CSLEW1" edc:mask="0x1" edc:name="I2CSLEW1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="I2C1RXB" edc:desc="I2C RECEIVE BUFFER REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="I2C1RXB" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-03057_i2c_8bit_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x16" edc:_addr="0x28A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB" edc:desc="" edc:mask="0xff" edc:name="RXB" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="wwwwwwww" edc:cname="I2C1TXB" edc:desc="I2C TRANSMIT BUFFER REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="I2C1TXB" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-03057_i2c_8bit_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x16" edc:_addr="0x28B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB" edc:desc="" edc:mask="0xff" edc:name="TXB" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I2C1CNTL" edc:desc="I2C COUNT REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="I2C1CNTL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-03057_i2c_8bit_v3.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x16" edc:_addr="0x28C">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CNT" edc:mask="0xff" edc:name="CNT" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CNT0" edc:mask="0x1" edc:name="CNT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CNT1" edc:mask="0x1" edc:name="CNT1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CNT2" edc:mask="0x1" edc:name="CNT2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CNT3" edc:mask="0x1" edc:name="CNT3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CNT4" edc:mask="0x1" edc:name="CNT4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CNT5" edc:mask="0x1" edc:name="CNT5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CNT6" edc:mask="0x1" edc:name="CNT6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CNT7" edc:mask="0x1" edc:name="CNT7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
