garyPenhook/PIC-Assembler/edc/PIC18F06Q40.PIC
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="CWG1AS1" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="CWG1AS1" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-02485_wg_ecwg_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x3C3">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AS0E" edc:desc="" edc:mask="0x1" edc:name="AS0E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AS1E" edc:desc="" edc:mask="0x1" edc:name="AS1E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AS2E" edc:desc="" edc:mask="0x1" edc:name="AS2E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AS3E" edc:desc="" edc:mask="0x1" edc:name="AS3E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AS4E" edc:mask="0x1" edc:name="AS4E" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AS5E" edc:mask="0x1" edc:name="AS5E" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AS6E" edc:mask="0x1" edc:name="AS6E" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AS7E" edc:mask="0x1" edc:name="AS7E" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CWG1STR" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CWG1STR" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02485_wg_ecwg_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x3C4">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STRA" edc:desc="" edc:mask="0x1" edc:name="STRA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRB" edc:desc="" edc:mask="0x1" edc:name="STRB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRC" edc:desc="" edc:mask="0x1" edc:name="STRC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRD" edc:desc="" edc:mask="0x1" edc:name="STRD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OVRA" edc:desc="" edc:mask="0x1" edc:name="OVRA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OVRB" edc:desc="" edc:mask="0x1" edc:name="OVRB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OVRC" edc:desc="" edc:mask="0x1" edc:name="OVRC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OVRD" edc:desc="" edc:mask="0x1" edc:name="OVRD" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CWG1STRA" edc:desc="" edc:mask="0x1" edc:name="CWG1STRA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1STRB" edc:desc="" edc:mask="0x1" edc:name="CWG1STRB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1STRC" edc:desc="" edc:mask="0x1" edc:name="CWG1STRC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1STRD" edc:desc="" edc:mask="0x1" edc:name="CWG1STRD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1OVRA" edc:desc="" edc:mask="0x1" edc:name="CWG1OVRA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1OVRB" edc:desc="" edc:mask="0x1" edc:name="CWG1OVRB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1OVRC" edc:desc="" edc:mask="0x1" edc:name="CWG1OVRC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1OVRD" edc:desc="" edc:mask="0x1" edc:name="CWG1OVRD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x12" edc:_addr="0x3C5"/>
        <edc:SFRDef edc:access="nrnnnnnn" edc:cname="FVRCON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu000000" edc:name="FVRCON" edc:nzwidth="8" edc:por="xx000000" edc:_modsrc="DOS-02541_amp_fvr_ts_ctrl_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1" edc:_addr="0x3D7">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADFVR" edc:desc="Zero-Cross Detect Positive-going Edge Interrupt Enable" edc:mask="0x3" edc:name="ADFVR" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="CDAFVR" edc:mask="0x3" edc:name="CDAFVR" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="TSRNG" edc:desc="Zero-Cross Detect Polarity bit" edc:mask="0x1" edc:name="TSRNG" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEN" edc:desc="Zero-Cross Detect Data Output" edc:mask="0x1" edc:name="TSEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RDY" edc:mask="0x1" edc:name="RDY" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="Zero-Cross Detect Software Enable bit" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADFVR0" edc:mask="0x1" edc:name="ADFVR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADFVR1" edc:mask="0x1" edc:name="ADFVR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CDAFVR0" edc:mask="0x1" edc:name="CDAFVR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CDAFVR1" edc:mask="0x1" edc:name="CDAFVR1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="FVRRDY" edc:mask="0x1" edc:name="FVRRDY" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FVREN" edc:mask="0x1" edc:name="FVREN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n------r" edc:cname="ADCPCON" edc:desc="" edc:impl="0x81" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0------0" edc:name="ADCPCON" edc:nzwidth="8" edc:por="0------0" edc:_addr="0x3D8">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="ADCP"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CPRDY" edc:mask="0x1" edc:name="CPRDY" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x6"/>
              <edc:SFRFieldDef edc:cname="ON" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADCPRDY" edc:mask="0x1" edc:name="ADCPRDY" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x6"/>
              <edc:SFRFieldDef edc:cname="CPON" edc:mask="0x1" edc:name="CPON" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="7"/>
              <edc:SFRFieldDef edc:cname="ADCPON" edc:mask="0x1" edc:name="ADCPON" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="ADLTH" edc:desc="" edc:name="ADLTH" edc:nzwidth="0x10" edc:_modsrc="DOS-03191_adc_sarcore_mp_ctrl_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3D9">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADLTHL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADLTHL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03191_adc_sarcore_mp_ctrl_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3D9">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="LTH" edc:desc="" edc:mask="0xff" edc:name="LTH" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADLTH0" edc:desc="" edc:mask="0x1" edc:name="ADLTH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH1" edc:desc="" edc:mask="0x1" edc:name="ADLTH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH2" edc:desc="" edc:mask="0x1" edc:name="ADLTH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH3" edc:desc="" edc:mask="0x1" edc:name="ADLTH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH4" edc:desc="" edc:mask="0x1" edc:name="ADLTH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH5" edc:desc="" edc:mask="0x1" edc:name="ADLTH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH6" edc:desc="" edc:mask="0x1" edc:name="ADLTH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ADLTH7" edc:desc="" edc:mask="0x1" edc:name="ADLTH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ADLTH" edc:mask="0xff" edc:name="ADLTH" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="LTH0" edc:mask="0x1" edc:name="LTH0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH1" edc:mask="0x1" edc:name="LTH1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH2" edc:mask="0x1" edc:name="LTH2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH3" edc:mask="0x1" edc:name="LTH3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH4" edc:mask="0x1" edc:name="LTH4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH5" edc:mask="0x1" edc:name="LTH5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH6" edc:mask="0x1" edc:name="LTH6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LTH7" edc:mask="0x1" edc:name="LTH7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
