garyPenhook/PIC-Assembler/edc/PIC18F06Q40.PIC
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x3ED"/>
        <edc:JoinedSFRDef edc:cname="ADACQ" edc:desc="" edc:name="ADACQ" edc:nzwidth="0x10" edc:_modsrc="DOS-03191_adc_sarcore_mp_ctrl_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3EE">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADACQL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADACQL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03191_adc_sarcore_mp_ctrl_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3EE">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ACQ" edc:mask="0xff" edc:name="ACQ" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADACQ0" edc:mask="0x1" edc:name="ADACQ0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADACQ1" edc:mask="0x1" edc:name="ADACQ1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADACQ2" edc:mask="0x1" edc:name="ADACQ2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADACQ3" edc:mask="0x1" edc:name="ADACQ3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADACQ4" edc:mask="0x1" edc:name="ADACQ4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADACQ5" edc:mask="0x1" edc:name="ADACQ5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADACQ6" edc:mask="0x1" edc:name="ADACQ6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADACQ7" edc:mask="0x1" edc:name="ADACQ7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ADACQ" edc:mask="0xff" edc:name="ADACQ" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="ACQ0" edc:mask="0x1" edc:name="ACQ0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACQ1" edc:mask="0x1" edc:name="ACQ1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACQ2" edc:mask="0x1" edc:name="ACQ2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACQ3" edc:mask="0x1" edc:name="ACQ3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACQ4" edc:mask="0x1" edc:name="ACQ4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACQ5" edc:mask="0x1" edc:name="ACQ5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACQ6" edc:mask="0x1" edc:name="ACQ6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACQ7" edc:mask="0x1" edc:name="ACQ7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="---nnnnn" edc:cname="ADACQH" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="ADACQH" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-03191_adc_sarcore_mp_ctrl_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3EF">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ACQ" edc:mask="0x1f" edc:name="ACQ" edc:nzwidth="0x5"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADACQ8" edc:mask="0x1" edc:name="ADACQ8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADACQ9" edc:mask="0x1" edc:name="ADACQ9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADACQ10" edc:mask="0x1" edc:name="ADACQ10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADACQ11" edc:mask="0x1" edc:name="ADACQ11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADACQ12" edc:mask="0x1" edc:name="ADACQ12" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ADACQ" edc:mask="0x1f" edc:name="ADACQ" edc:nzwidth="0x5"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="ACQ8" edc:mask="0x1" edc:name="ACQ8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACQ9" edc:mask="0x1" edc:name="ACQ9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACQ10" edc:mask="0x1" edc:name="ACQ10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACQ11" edc:mask="0x1" edc:name="ACQ11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACQ12" edc:mask="0x1" edc:name="ACQ12" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="ADCAP" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="ADCAP" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-03191_adc_sarcore_mp_ctrl_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3F0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CAP" edc:mask="0x1f" edc:name="CAP" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADCAP0" edc:desc="" edc:mask="0x1" edc:name="ADCAP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCAP1" edc:desc="" edc:mask="0x1" edc:name="ADCAP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCAP2" edc:desc="" edc:mask="0x1" edc:name="ADCAP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCAP3" edc:desc="" edc:mask="0x1" edc:name="ADCAP3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCAP4" edc:desc="" edc:mask="0x1" edc:name="ADCAP4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="ADPRE" edc:desc="" edc:name="ADPRE" edc:nzwidth="0x10" edc:_modsrc="DOS-03191_adc_sarcore_mp_ctrl_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3F1">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADPREL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADPREL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03191_adc_sarcore_mp_ctrl_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3F1">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PRE" edc:mask="0xff" edc:name="PRE" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PRE0" edc:mask="0x1" edc:name="PRE0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRE1" edc:mask="0x1" edc:name="PRE1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRE2" edc:mask="0x1" edc:name="PRE2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRE3" edc:mask="0x1" edc:name="PRE3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRE4" edc:mask="0x1" edc:name="PRE4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRE5" edc:mask="0x1" edc:name="PRE5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRE6" edc:mask="0x1" edc:name="PRE6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRE7" edc:mask="0x1" edc:name="PRE7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ADPRE" edc:mask="0xff" edc:name="ADPRE" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="ADPRE0" edc:mask="0x1" edc:name="ADPRE0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADPRE1" edc:mask="0x1" edc:name="ADPRE1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADPRE2" edc:mask="0x1" edc:name="ADPRE2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADPRE3" edc:mask="0x1" edc:name="ADPRE3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADPRE4" edc:mask="0x1" edc:name="ADPRE4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADPRE5" edc:mask="0x1" edc:name="ADPRE5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADPRE6" edc:mask="0x1" edc:name="ADPRE6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADPRE7" edc:mask="0x1" edc:name="ADPRE7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="---nnnnn" edc:cname="ADPREH" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="ADPREH" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-03191_adc_sarcore_mp_ctrl_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3F2">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PRE" edc:mask="0x1f" edc:name="PRE" edc:nzwidth="0x5"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PRE8" edc:mask="0x1" edc:name="PRE8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRE9" edc:mask="0x1" edc:name="PRE9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRE10" edc:mask="0x1" edc:name="PRE10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRE11" edc:mask="0x1" edc:name="PRE11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRE12" edc:mask="0x1" edc:name="PRE12" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ADPRE" edc:mask="0x1f" edc:name="ADPRE" edc:nzwidth="0x5"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="ADPRE8" edc:mask="0x1" edc:name="ADPRE8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADPRE9" edc:mask="0x1" edc:name="ADPRE9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADPRE10" edc:mask="0x1" edc:name="ADPRE10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADPRE11" edc:mask="0x1" edc:name="ADPRE11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADPRE12" edc:mask="0x1" edc:name="ADPRE12" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nn-nnn-n" edc:cname="ADCON0" edc:desc="" edc:impl="0xdd" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-000-0" edc:name="ADCON0" edc:nzwidth="0x8" edc:por="00-000-0" edc:_modsrc="DOS-03191_adc_sarcore_mp_ctrl_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3F3">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="GO" edc:desc="" edc:mask="0x1" edc:name="GO" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="FM" edc:mask="0x3" edc:name="FM" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="CS" edc:desc="" edc:mask="0x1" edc:name="CS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CONT" edc:desc="" edc:mask="0x1" edc:name="CONT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADGO" edc:mask="0x1" edc:name="ADGO" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ADFM" edc:mask="0x3" edc:name="ADFM" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="ADCS" edc:mask="0x1" edc:name="ADCS" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCONT" edc:mask="0x1" edc:name="ADCONT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADON" edc:mask="0x1" edc:name="ADON" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="DONE" edc:mask="0x1" edc:name="DONE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="FM0" edc:mask="0x1" edc:name="FM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FM1" edc:mask="0x1" edc:name="FM1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="GO_nDONE" edc:mask="0x1" edc:name="GO_nDONE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ADFM0" edc:mask="0x1" edc:name="ADFM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADFM1" edc:mask="0x1" edc:name="ADFM1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
